app/controllers/movies_controller.rb

    def index
      @all_ratings = Movie.all_ratings
      @ratings_to_show = Movie.all_ratings
      /if params[:ratings].nil? && !session[:ratings].nil?
        redirect_to movies_path("ratings" => session[:ratings])/
      if !params[:sort].nil?
        session[:sort] = params[:sort]
        @movies = Movie.order(session[:sort])
      elsif !session[:sort].nil?
        @movies = Movie.order(session[:sort])
      elsif not params[:ratings].nil?
        session[:ratings] = params[:ratings]
        @ratings_to_show = params[:ratings].keys
        @movies = Movie.where(rating: @ratings_to_show)
---
SELECT "movies".* FROM "movies"  ORDER BY release_date
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') AND "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')  ORDER BY release_date